Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes Constructor
 Creates a new default part attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PartAttributes()
Public Sub New
See Also
Reference
Part.PartAttributes Class
Part.PartAttributes Overload
Tekla.Structures.Drawing Namespace